/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Extensión Telesec";
"06 06 02 82 06 01 0A 01"		= "Mecanismo Telesec";

"06 07 02 82 06 01 0A 01 00"	= "Autenticación Telesec";
"06 08 02 82 06 01 0A 01 00 01"	= "Autenticación de contraseña";
"06 08 02 82 06 01 0A 01 00 02" = "Autenticación de contraseña protegida";
"06 08 02 82 06 01 0A 01 00 03" = "Autenticación X.509 unidireccional";
"06 08 02 82 06 01 0A 01 00 04" = "Autenticación X.509 bidireccional";
"06 08 02 82 06 01 0A 01 00 05" = "Autenticación X.509 tridireccional";
"06 08 02 82 06 01 0A 01 00 06" = "Autenticación ISO9798 unidireccional";
"06 08 02 82 06 01 0A 01 00 07" = "Autenticación ISO9798 bidireccional";
"06 08 02 82 06 01 0A 01 00 08" = "Autenticación Telekom";

"06 07 02 82 06 01 0A 01 01"	= "Firma Telesec";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 con RSA e ISO9697";
"06 08 02 82 06 01 0A 01 01 02"	= "MD4 con RSA y estándar de firma Telesec";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 con RSA e ISO9697";
"06 08 02 82 06 01 0A 01 01 04"	= "MD5 con RSA y estándar de firma Telesec";
"06 08 02 82 06 01 0A 01 01 05"	= "RIPEMD-160 con RSA y estándar de firma Telekom";
"06 08 02 82 06 01 0A 01 01 09"	= "Firma RSA HBCI";

"06 07 02 82 06 01 0A 01 02"	= "Encriptación Telesec";
"06 08 02 82 06 01 0A 01 02 00"	= "ninguno";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Magenta";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "Función unidireccional";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "Hash usando cifrado de bloque";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "Función FEC";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Módulo Telesec";
"06 07 02 82 06 01 0A 02 00"	= "Algoritmos";
"06 07 02 82 06 01 0A 02 01"	= "Tipos de atributo";
"06 07 02 82 06 01 0A 02 02"	= "Tipos de certificado";
"06 07 02 82 06 01 0A 02 03"	= "Tipos de mensaje";
"06 07 02 82 06 01 0A 02 04"	= "Protocolo PL";
"06 07 02 82 06 01 0A 02 05"	= "SME y componentes de SME";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "Definiciones útiles";
"06 07 02 82 06 01 0A 02 08"	= "Archivos STE";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "Pedido electrónico";
"06 07 02 82 06 01 0A 02 0B"	= "Aplicación asimétrica TTP Telesec";
"06 07 02 82 06 01 0A 02 0C"	= "Aplicación de base TTP Telesec";
"06 07 02 82 06 01 0A 02 0D"	= "Mensajes TTP Telesec";
"06 07 02 82 06 01 0A 02 0E"	= "Aplicación de impresión de fecha TTP Telesec";

"06 06 02 82 06 01 0A 03"		= "Clase de objeto";
"06 07 02 82 06 01 0A 03 00"	= "Otro nombre Telesec";
"06 07 02 82 06 01 0A 03 01"	= "Directorio";
"06 07 02 82 06 01 0A 03 02"	= "Tipo de directorio";
"06 07 02 82 06 01 0A 03 03"	= "Grupo de directorios";
"06 07 02 82 06 01 0A 03 04"	= "Usuario de directorios";
"06 07 02 82 06 01 0A 03 05"	= "Entrada de clave simétrica";

"06 06 02 82 06 01 0A 04"		= "Paquete";
"06 06 02 82 06 01 0A 05"		= "Parámetro";
"06 06 02 82 06 01 0A 06"		= "Unión de nombres";
"06 06 02 82 06 01 0A 07"		= "Atributo";
"06 07 02 82 06 01 0A 07 00"	= "Identificador de grupo de aplicaciones";
"06 07 02 82 06 01 0A 07 01"	= "Tipo de certificado";
"06 07 02 82 06 01 0A 07 02"	= "Certificado Telesec";
"06 07 02 82 06 01 0A 07 03"	= "Número de certificado";
"06 07 02 82 06 01 0A 07 04"	= "Lista de revocación de certificados";
"06 07 02 82 06 01 0A 07 05"	= "Fecha de creación";
"06 07 02 82 06 01 0A 07 06"	= "Emisor";
"06 07 02 82 06 01 0A 07 07"	= "Autoridad de nombres";
"06 07 02 82 06 01 0A 07 08"	= "Directorio de clave pública";
"06 07 02 82 06 01 0A 07 09"	= "Dominio de seguridad";
"06 07 02 82 06 01 0A 07 0A"	= "Asunto";
"06 07 02 82 06 01 0A 07 0B"	= "Tiempo de revocación";
"06 07 02 82 06 01 0A 07 0C"	= "Referencia de grupo de usuarios";
"06 07 02 82 06 01 0A 07 0D"	= "Validez";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "Entorno de mensajes de seguridad";
"06 07 02 82 06 01 0A 07 10"	= "Directorio de claves públicas anónimas";
"06 07 02 82 06 01 0A 07 11"	= "Nombre de pila Telesec";
"06 07 02 82 06 01 0A 07 12"	= "Adiciones de nombre";
"06 07 02 82 06 01 0A 07 13"	= "Código postal Telesec";
"06 07 02 82 06 01 0A 07 14"	= "Discriminador de nombre";
"06 07 02 82 06 01 0A 07 15"	= "Lista de certificados Telesec";
"06 07 02 82 06 01 0A 07 16"	= "Lista de certificados Teletrust";
"06 07 02 82 06 01 0A 07 17"	= "Lista de certificados X.509";
"06 07 02 82 06 01 0A 07 18"	= "Tiempo de emisión";
"06 07 02 82 06 01 0A 07 19"	= "Número de tarjeta física";
"06 07 02 82 06 01 0A 07 1A"	= "Tipo de archivo";
"06 07 02 82 06 01 0A 07 1B"	= "El archivo Ctl es un archivo comprimido";
"06 07 02 82 06 01 0A 07 1C"	= "Dirección de correo";
"06 07 02 82 06 01 0A 07 1D"	= "Lista de plantillas de certificados";
"06 07 02 82 06 01 0A 07 1E"	= "Nombre de directorio";
"06 07 02 82 06 01 0A 07 1F"	= "Nombre de tipo de directorio";
"06 07 02 82 06 01 0A 07 20"	= "Nombre de grupo de directorio";
"06 07 02 82 06 01 0A 07 21"	= "Nombre de usuario de directorios";
"06 07 02 82 06 01 0A 07 22"	= "Indicador de revocación";
"06 07 02 82 06 01 0A 07 23"	= "Nombre de entrada de clave simétrica";
"06 07 02 82 06 01 0A 07 24"	= "Número GL";
"06 07 02 82 06 01 0A 07 25"	= "Número GO";
"06 07 02 82 06 01 0A 07 26"	= "Datos de clave G";
"06 07 02 82 06 01 0A 07 27"	= "Datos de clave Z";
"06 07 02 82 06 01 0A 07 28"	= "Datos de clave KT";
"06 07 02 82 06 01 0A 07 2A"	= "Número de clave KT";
"06 07 02 82 06 01 0A 07 33"	= "Tiempo de generación de la revocación";
"06 07 02 82 06 01 0A 07 34"	= "Texto de responsabilidad";

"06 06 02 82 06 01 0A 08"		= "Grupo de atributos";
"06 06 02 82 06 01 0A 09"		= "Acción";
"06 06 02 82 06 01 0A 0A"		= "Notificación";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "Aplicación de seguridad";

"06 06 02 82 06 01 0A 0C"		= "Definiciones de extensiones de certificados y CRL";

"06 07 02 82 06 01 0A 0C 00"	= "Extensión de la limitación de responsabilidad de la extensión del certificado";
"06 07 02 82 06 01 0A 0C 01"	= "Extensión de identificación de certificado Telesec";
"06 07 02 82 06 01 0A 0C 02"	= "Identificador de política Telesec";
"06 07 02 82 06 01 0A 0C 03"	= "Identificador de calificador de política Telesec";
"06 07 02 82 06 01 0A 0C 04"	= "Extensión filtrada CRL Telesec";
"06 07 02 82 06 01 0A 0C 05"	= "Extensión de filtro CRL Telesec";
"06 07 02 82 06 01 0A 0C 06"	= "Extensión de autoridad de nombres Telesec";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "ID de usuario";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "Buzón RFC822";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "Componente de dominio";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "Número de actividad comercial australiana";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "Identificador de política de Certificates Australia";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Sello personal";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Sello empresarial";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Sello legal";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Sello piloto";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Sello IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Identificador de política de sello";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "Algoritmo de encriptación simétrica";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "CP SEIS";
"06 06 2A 85 70 22 01 01"	= "Identificador de política de alta seguridad SEIS";
"06 06 2A 85 70 22 01 02"	= "Identificador de política GAK SEIS";
"06 05 2A 85 70 22 02"		= "PE SEIS";
"06 05 2A 85 70 22 03"		= "AT SEIS";
"06 06 2A 85 70 22 03 01"	= "Identificador personal AT SEIS";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "Módulo X9.57 ANSI";
"06 07 2A 86 48 CE 38 01 01"	= "Gestión de certificados X9F1";
"06 06 2A 86 48 CE 38 02"		= "Instrucción de suspensión";
"06 07 2A 86 48 CE 38 02 01"	= "Instrucción de suspensión: ninguna";
"06 07 2A 86 48 CE 38 02 02"	= "Llamar al emisor";
"06 07 2A 86 48 CE 38 02 03"	= "Rechazar";
"06 07 2A 86 48 CE 38 02 04"	= "Señal de elección";
"06 06 2A 86 48 CE 38 03"		= "Atributo";
"06 06 2A 86 48 CE 38 03 01"	= "Contrafirma";
"06 06 2A 86 48 CE 38 03 02"	= "Certificado de atributos";
"06 06 2A 86 48 CE 38 04"		= "Algoritmo";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "DSA Match";
"06 07 2A 86 48 CE 38 04 03"	= "DSA con SHA-1";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "Tipo de campo ANSI X9.62";
"06 07 2A 86 48 CE 3D 01 01"	= "Campo principal";
"06 07 2A 86 48 CE 3D 01 02"	= "Campo Característica-dos";
"06 09 2A 86 48 CE 3D 01 02 03"	= "Base Característica-dos";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Base nula";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "Base trinomial";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "Base pentanomial";
"06 06 2A 86 48 CE 3D 02"		= "Tipo de clave pública";
"06 07 2A 86 48 CE 3D 02 01"	= "Clave pública de curva elíptica";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "Tipo de campo X9.42 ANSI";
"06 07 2A 86 48 CE 3E 01 01"	= "Campo Galois principal";
"06 06 2A 86 48 CE 3E 02"		= "Tipo de número";
"06 07 2A 86 48 CE 3E 02 01"	= "Clave pública Diffie-Hellman";
"06 06 2A 86 48 CE 3E 03"		= "Esquema";
"06 07 2A 86 48 CE 3E 03 01"	= "Diffie-Hellman estática";
"06 07 2A 86 48 CE 3E 03 02"	= "Diffie-Hellman efímera";
"06 07 2A 86 48 CE 3E 03 03"	= "Diffie-Hellman híbrido 1";
"06 07 2A 86 48 CE 3E 03 04"	= "Diffie-Hellman híbrido 2";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Información de versión de Entrust";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PBE con MD5 y CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "MAC basado en contraseña";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Usuario de Entrust";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Información de CA Entrust";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "Certificado de atributos";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "Encriptación RSA";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "MD2 con encriptación RSA";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "MD4 con encriptación RSA";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "MD5 con encriptación RSA";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "SHA-1 con encriptación RSA";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "Encriptación RSA-OAEP (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "Encriptación RSA-OAEP";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "Etiqueta RSA-OAEP especificada";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "Esquema de firmas RSA-PSS";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "SHA-256 con encriptación RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "SHA-384 con encriptación RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "SHA-512 con encriptación RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "SHA-224 con encriptación RSA";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "Encriptación RSA BSAFE";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Contrato de clave Diffie-Hellman";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PBE con MD2 y DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PBE con MD5 y DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PBE con MD2 y RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PBE con MD5 y RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE con MD5 y XOR";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PBE con SHA y DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "Datos";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "Datos firmados";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "Datos protegidos";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "Datos firmados y protegidos";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "Datos resumidos";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "Datos encriptados";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "Datos con atributos";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "Información de clave privada encriptada";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "Dirección de correo";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "Nombre sin estructura";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "Tipo de contenido";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "Message Digest";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "Fecha y hora de firma";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Contrafirma";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "Contraseña de comprobación";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "Dirección sin estructura";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "Atributos de certificado ampliados";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "Emisor y número de serie";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "Comprobación de contraseña";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "Clave pública";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "Descripción de firma";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "Petición de extensión";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "Recursos S/MIME";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "Preferir datos firmados";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "No se puede descifrar ninguno";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "Petición de confirmación";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "Confirmación";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "Indicaciones de contenido";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "Historial de expansión de lista de correo";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "Módulos S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "Sintaxis de mensajes cifrados";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "Servicios de seguridad mejorados";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "Identificador de objeto S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "Mensaje V3 S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "Firma electrónica ETS 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "Firma electrónica ETS 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "Política de firmas electrónicas ETS 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "Política de firmas electrónicas ETS 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "Tipos de contenido S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "Atributos autenticados S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "Algoritmos S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "Distribución de certificados S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "Distribución de certificados LDAP";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "Calificador de política de firma S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "Identificador de tipo de firma S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "Firma del creador";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "Firma de dominio";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "Firma de atributos adicionales";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "Revisar firma";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "Recursos S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "Preferir binario interno";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "Nombre descriptivo (para PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "Identificador de clave local (para PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "Tipos de certificado (para PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "Certificado X.509 (para PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "Certificado SDSI (para PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "Tipos de CRL (para PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "CRL X.509 (para PKCS-12)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "Sintaxis de intercambio de información personal PKCS-12";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "Identificadores de encriptación basada en contraseña PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE con SHA-1 y RC4 de 128 bits";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE con SHA-1 y RC4 de 40 bits";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PBE con SHA-1 y Triple DES-CBC de 3 claves";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PBE con SHA-1 y Triple DES-CBC de 2 claves";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE con SHA-1 y RC2-CBC de 128 bits";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE con SHA-1 y RC2-CBC de 40 bits";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "Identificadores ESPVK PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "Cobertura de claves PKCS-12 PKCS-8";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "Identificadores Bag PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "Identificador Bag de claves PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "Identificador Bag de CRL y certificados PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "Identificador Bag secreto PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "Identificador de contenido seguro PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "Identificador Bag de claves encubiertas PKCS-12 PKCS-8";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "Identificador Bag de certificados PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "Identificador Bag de CRL y certificados PKCS-12 X.509";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "Identificador Bag de certificados SDSI PKCS-12";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "Identificador de objeto PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "Identificador de encriptación basada en contraseña PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PKCS-12 PBE con SHA-1 y RC4 de 128 bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PKCS-12 PBE con SHA-1 y RC4 de 40 bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PKCS-12 PBE con SHA-1 y Triple DES-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PKCS-12 PBE con SHA-1 y RC2-CBC de 128 bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PKCS-12 PBE con SHA-1 y RC2-CBC de 40 bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PKCS-12 PBE con SHA-1 y RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PKCS-12 PBE con SHA-1 y RC2-CBC";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "Identificadores de protección PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "Encriptación RSA PKCS-12 con RC4 de 128 bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "Encriptación RSA PKCS-12 con RC4 de 40 bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "Encriptación RSA PKCS-12 con Triple DES";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "Identificador de firma PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "Encriptación RSA PKCS-12 con SHA-1 Digest";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 versión 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "Identificadores Bag PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "Bag de clave PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "Bag de clave encubierta PKCS-12 PKCS-8";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "Bag de certificado PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "Bag de CRL PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "Bag secreto PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "Bag de contenido seguro PKCS-12";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "Módulos PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "Atributos PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "Tipo de contenido PKCS-15";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "Contenido PKCS-15";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "Algoritmo Digest RSADSI";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC con SHA-1";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "Algoritmo de encriptación RSADSI";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 con MAC";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "Pad RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Identificador de política desconocida Identrus";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "Kerberos de usuario a usuario MIT";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Clase de objeto de Microsoft Exchange Server";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Direccionamiento de sitios";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "Esquema de objetos";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "Esquema de atributos";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "Agente-Buzón";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "Buzón";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "Contenedor";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "Destinatario de correo";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "Mecanismo de entrega";

"06 07 2A 86 48 86 F7 14 04"				= "Formatos de archivo de Microsoft";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Authenticode";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "Contexto de datos indirectos SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "Información de agencia SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "Tipo de instrucción SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "Información Opus SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "Extensiones de certificado SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "Datos de imagen PE SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "Enlace SPC (tipo 1)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "Firma de código individual";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "Firma de código comercial";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "Enlace SPC (tipo 2)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "Criterios mínimos SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "Criterios financieros SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "Enlace SPC (tipo 3)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "Proveedor de soporte de seguridad NTLM";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "Contrafirma de impresión de fecha";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "Lista de certificados de confianza";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "Extensión CTL ordenada";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "Próxima ubicación de actualización";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "Uso de claves mejorado";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "Firma de lista de certificados de confianza";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "Firma de impresión de fecha";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "Cifrado por puertas de enlace de servidor";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "Encriptación serializada";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "Sistemas de archivos encriptados";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "Recuperación de sistemas de archivos encriptados";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Compatible con hardware Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "Firma NT5";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Firma OEM de hardware Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "Firma NT incrustada";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "Firma de lista raíz de confianza";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "Subordinación completa";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "Recuperación de claves";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "Firma del documento";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "Identificadores de objetos de atributo";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "Atributo de confianza Sí/No";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "DRM de música de Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Individualización DRM de Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Licencias de Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Servidor de licencias de Microsoft";

"06 08 2B 06 01 04 01 82 37 0D"				= "Identificadores de objetos PKCS-10 de Microsoft";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "Certificado de renovación";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "Pareja de valores/nombre de inscripción";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "CSP de inscripción";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "Versión del sistema operativo";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Atributos PKCS-12 de Microsoft";
"06 09 2B 06 01 04 01 82 37 11 01"			= "Conjunto de claves de la máquina local";

"06 08 2B 06 01 04 01 82 37 14"				= "Infraestructura de inscripción de Microsoft";
"06 09 2B 06 01 04 01 82 37 14 01"			= "Uso de CTL de inscripción automática";
"06 09 2B 06 01 04 01 82 37 14 02"			= "Tipo de certificado de inscripción";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "Agente de inscripción";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "Inicio de sesión de tarjeta inteligente";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "Nombre principal de NT";

"06 08 2B 06 01 04 01 82 37 15"				= "Infraestructura de Certificate Server de Microsoft";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Versión de renovación de CA de Microsoft";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "Versión de CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 02"			= "Atributo de CAPICOM";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "Nombre del documento";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "Descripción del documento";
"06 09 2B 06 01 04 01 82 37 58 03"			= "Datos encriptados";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "Contenido encriptado";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "Identificador de política UNINETT";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "Identificador de política ICE-TEL";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "Identificador de política de CA ICE-TEL";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal con SHA-1";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal con RIPEMD-160";
"06 09 2B 06 01 04 01 97 55 03 01"			= "Atributos cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "Comprobación de presencia cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "Respuesta OCSP RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "Respuesta OCSP RTCS ampliada";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "Razón ampliada de CRL";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "Características de la clave";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "Inicialización PKI";
"06 09 2B 06 01 04 01 97 55 04 01"			= "Contenido cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "Datos de configuración cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "Índice de usuarios cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "Información de usuarios cryptlib";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "Identificador de política XYZZY";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Timeproof";
"06 08 2B 06 01 04 01 AA 60 01"		= "Sistema de validación temporal";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "Sistema de validación temporal 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "Sistema de validación temporal 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "Sistema de validación temporal 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "Prácticas secundarias";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "Identificadores de médicos";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "Kerberos PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "Datos de autenticación Kerberos";
"06 07 2B 06 01 05 02 03 02"        = "Datos de clave Diffie-Hellman Kerberos";
"06 07 2B 06 01 05 02 03 03"        = "Datos de clave de respuesta Kerberos";
"06 07 2B 06 01 05 02 03 04"        = "Autenticación de cliente Kerberos";
"06 07 2B 06 01 05 02 03 05"        = "Distrib. de claves Kerberos";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "SPKM (Simple Public Key Mechanism)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "Infraestructura de clave pública";

"06 07 2B 06 01 05 05 07 01"		= "Extensiones de certificados privados PKIX";
"06 08 2B 06 01 05 05 07 01 01"		= "Acceso a la información de la entidad de certificación";
"06 08 2B 06 01 05 05 07 01 02"		= "Información biométrica";
"06 08 2B 06 01 05 05 07 01 03"		= "Instrucciones de certificado completas";
"06 08 2B 06 01 05 05 07 01 04"		= "Identidad de responsabilidad del certificado de atributos";
"06 08 2B 06 01 05 05 07 01 05"		= "Destino del certificado de atributos";
"06 08 2B 06 01 05 05 07 01 06"		= "Controles de la entidad emisora del certificado de atributos";
"06 08 2B 06 01 05 05 07 01 07"		= "Bloque de direcciones IP SBGP";
"06 08 2B 06 01 05 05 07 01 08"		= "Identificador de sistema autónomo SBGP";
"06 08 2B 06 01 05 05 07 01 09"		= "Identificador de router SBGP";
"06 08 2B 06 01 05 05 07 01 0A"		= "Creación de proxy de certificado de atributos";
"06 08 2B 06 01 05 05 07 01 0B"		= "Acceso a la información del sujeto";
"06 08 2B 06 01 05 05 07 01 0C"		= "Logotipo";

"06 07 2B 06 01 05 05 07 02"		= "Tipos de calificador de política";
"06 08 2B 06 01 05 05 07 02 01"		= "Instrucción de prácticas de certificación";
"06 08 2B 06 01 05 05 07 02 02"		= "Aviso de usuario";
"06 08 2B 06 01 05 05 07 02 03"		= "Aviso del texto";

"06 07 2B 06 01 05 05 07 03"		= "Finalidad de la clave";
"06 08 2B 06 01 05 05 07 03 01"		= "Autenticación de servidor";
"06 08 2B 06 01 05 05 07 03 02"		= "Autenticación de cliente";
"06 08 2B 06 01 05 05 07 03 03"		= "Firma de código";
"06 08 2B 06 01 05 05 07 03 04"		= "Protección de correo electrónico";
"06 08 2B 06 01 05 05 07 03 05"		= "Sistema final IPsec";
"06 08 2B 06 01 05 05 07 03 06"		= "Túnel IPsec";
"06 08 2B 06 01 05 05 07 03 07"		= "Usuario IPsec";
"06 08 2B 06 01 05 05 07 03 08"		= "Impresión de fecha";
"06 08 2B 06 01 05 05 07 03 09"		= "Firma OCSP";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "Autenticación de servidor AA SBGP";

"06 07 2B 06 01 05 05 07 04"		= "Tipos de información CMP";
"06 08 2B 06 01 05 05 07 04 01"		= "Certificado de encriptación del protocolo de CA";
"06 08 2B 06 01 05 05 07 04 02"		= "Tipos de parejas de claves de firma";
"06 08 2B 06 01 05 05 07 04 03"		= "Tipos de parejas de claves de encriptación";
"06 08 2B 06 01 05 05 07 04 04"		= "Algoritmo simétrico preferido";
"06 08 2B 06 01 05 05 07 04 05"		= "Información de actualización de claves de CA";
"06 08 2B 06 01 05 05 07 04 06"		= "CRL actual";
"06 08 2B 06 01 05 05 07 04 07"		= "Identificadores de objeto no compatibles";
"06 08 2B 06 01 05 05 07 04 08"		= "Petición de suscripción";
"06 08 2B 06 01 05 05 07 04 09"		= "Respuesta a la suscripción";
"06 08 2B 06 01 05 05 07 04 0A"		= "Petición de parámetros de parejas de claves";
"06 08 2B 06 01 05 05 07 04 0B"		= "Respuesta de parámetros de parejas de claves";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "Registro CRMF";
"06 08 2B 06 01 05 05 07 05 01"		= "Control de registro";
"06 09 2B 06 01 05 05 07 05 01 01"	= "Señal de registro";
"06 09 2B 06 01 05 05 07 05 01 02"	= "Autenticador";
"06 09 2B 06 01 05 05 07 05 01 03"	= "Información de publicación PKI";
"06 09 2B 06 01 05 05 07 05 01 04"	= "Opciones de compresión PKI";
"06 09 2B 06 01 05 05 07 05 01 05"	= "Identificación de certificado antiguo";
"06 09 2B 06 01 05 05 07 05 01 06"	= "Clave de encriptación de protocolo";
"06 09 2B 06 01 05 05 07 05 01 07"	= "Plantilla de certificado alternativa";
"06 09 2B 06 01 05 05 07 05 01 08"	= "Plantilla WTLS WAP";

"06 08 2B 06 01 05 05 07 05 02"		= "Información de registro CRMF";
"06 09 2B 06 01 05 05 07 05 02 01"	= "Parejas UTF-8";
"06 09 2B 06 01 05 05 07 05 02 02"	= "Petición de certificado";

"06 07 2B 06 01 05 05 07 06"		= "Algoritmos";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "Sin firma";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "Controles CMC";

"06 07 2B 06 01 05 05 07 08"		= "Otros nombres";
"06 08 2B 06 01 05 05 07 08 01"		= "Datos personales";
"06 08 2B 06 01 05 05 07 08 02"		= "Grupo de usuarios";

"06 07 2B 06 01 05 05 07 09"		= "Datos personales";
"06 08 2B 06 01 05 05 07 09 01"		= "Fecha de nacimiento";
"06 08 2B 06 01 05 05 07 09 02"		= "Lugar de nacimiento";
"06 08 2B 06 01 05 05 07 09 03"		= "Pseudónimo";
"06 08 2B 06 01 05 05 07 09 04"		= "Sexo";
"06 08 2B 06 01 05 05 07 09 05"		= "País de ciudadanía";
"06 08 2B 06 01 05 05 07 09 06"		= "País de residencia";

"06 07 2B 06 01 05 05 07 0A"		= "Certificado de atributos";
"06 08 2B 06 01 05 05 07 0A 01"		= "Información de autenticación";
"06 08 2B 06 01 05 05 07 0A 02"		= "Identidad de acceso";
"06 08 2B 06 01 05 05 07 0A 03"		= "Identidad de cargo";
"06 08 2B 06 01 05 05 07 0A 04"		= "Grupo";
"06 08 2B 06 01 05 05 07 0A 05"		= "Función";
"06 08 2B 06 01 05 05 07 0A 06"		= "SSID de WLAN";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "Protocolo de estado del certificado en línea";
"06 09 2B 06 01 05 05 07 30 01 01"	= "Respuesta básica OCSP";
"06 09 2B 06 01 05 05 07 30 01 02"	= "Extensión de identificador temporal OCSP";
"06 09 2B 06 01 05 05 07 30 01 03"	= "Referencia de CRL OCSP";
"06 09 2B 06 01 05 05 07 30 01 04"	= "Respuesta OCSP";
"06 09 2B 06 01 05 05 07 30 01 05"	= "Comprobación de no revocación OCSP";
"06 09 2B 06 01 05 05 07 30 01 06"	= "Límite de compresión OCSP";
"06 09 2B 06 01 05 05 07 30 01 07"	= "Localizador de servicio OCSP";

"06 08 2B 06 01 05 05 07 30 02"		= "Emisores de CA";
"06 08 2B 06 01 05 05 07 30 03"		= "Impresión de fecha";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "IKE intermedio";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "Algoritmo de encriptación DEC";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "Algoritmo hash DEC";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "Algoritmo de firma DEC";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 con RSA";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 con RSA";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 con RSA";
"06 05 2B 0E 03 02 03"				= "MD5 con RSA";
"06 05 2B 0E 03 02 04"				= "MD4 con encriptación RSA";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N con RSA";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "Firma RSA";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA con SHA";
"06 05 2B 0E 03 02 0E"				= "MDC2 con firma RSA";
"06 05 2B 0E 03 02 0F"				= "SHA con firma RSA";
"06 05 2B 0E 03 02 10"				= "Diffie-Hellman con Common Modulus";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA común";
"06 05 2B 0E 03 02 15"				= "DSA común con SHA";
"06 05 2B 0E 03 02 16"				= "Transporte de claves RSA";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "MD2 con firma RSA";
"06 05 2B 0E 03 02 19"				= "MD5 con firma RSA";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "DSA con SHA-1";
"06 05 2B 0E 03 02 1C"				= "DSA con SHA-1 común";
"06 05 2B 0E 03 02 1D"				= "SHA-1 con encriptación RSA";
"06 05 2B 0E 03 03 01"				= "Simple-strong-auth-mechanism";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 con RSA";
"06 06 2B 0E 07 02 03 02"			= "MD2 con ElGamal";

/* Teletrust */

"06 03 2B 24 01"					= "Documento";
"06 04 2B 24 01 01"					= "Versión final";
"06 04 2B 24 01 02"					= "Borrador";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "Algoritmo";
"06 04 2B 24 03 01"					= "Algoritmo de encriptación";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "Pad DES-ECB";
"06 07 2B 24 03 01 01 01 01"		= "Pad DES-ECB ISO";
"06 07 2B 24 03 01 01 02 01"		= "Pad DES-CBC";
"06 08 2B 24 03 01 01 02 01 01"		= "Pad DES-CBC ISO";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "DES3-ECB Pad";
"06 08 2B 24 03 01 03 01 01 01"		= "DES3-ECB ISO Pad";
"06 07 2B 24 03 01 03 02 01"		= "DES3-CBC Pad";
"06 08 2B 24 03 01 03 02 01 01"		= "DES3-CBC ISO Pad";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "Pad IDEA-ECB";
"06 08 2B 24 03 01 02 01 01 01"		= "Pad IDEA-ECB ISO";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "Pad IDEA-CBC";
"06 08 2B 24 03 01 02 02 01 01"		= "Pad IDEA-CBC ISO";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "Encriptación RSA";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "BSI-1-ECB Pad";
"06 06 2B 24 03 01 05 02"			= "BSI-1-CBC Pad";
"06 07 2B 24 03 01 05 02 01"		= "BSI-1-CBC PEM Pad";

"06 04 2B 24 03 02"					= "Algoritmo hash";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "MDC2 de longitud única";
"06 05 2B 24 03 02 05"				= "MDC2 de longitud doble";
"06 04 2B 24 03 03"					= "Algoritmo de firma";
"06 05 2B 24 03 03 01"				= "Firma RSA";

"06 06 2B 24 03 03 01 01"			= "Firma RSA con SHA-1";
"06 09 2B 24 03 03 01 01 84 00 02"	= "Firma RSA con SHA-1 512/L2";
"06 09 2B 24 03 03 01 01 85 00 02"	= "Firma RSA con SHA-1 640/L2";
"06 09 2B 24 03 03 01 01 86 00 02"	= "Firma RSA con SHA-1 768/L2";
"06 09 2B 24 03 03 01 01 87 00 02"	= "Firma RSA con SHA-1 896/L2";
"06 09 2B 24 03 03 01 01 88 00 02"	= "Firma RSA con SHA-1 1024/L2";
"06 09 2B 24 03 03 01 01 84 00 03"	= "Firma RSA con SHA-1 512/L3";
"06 09 2B 24 03 03 01 01 85 00 03"	= "Firma RSA con SHA-1 640/L3";
"06 09 2B 24 03 03 01 01 86 00 03"	= "Firma RSA con SHA-1 768/L3";
"06 09 2B 24 03 03 01 01 87 00 03"	= "Firma RSA con SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 03"	= "Firma RSA con SHA-1 1024/L3";
"06 09 2B 24 03 03 01 01 84 00 05"	= "Firma RSA con SHA-1 512/L5";
"06 09 2B 24 03 03 01 01 85 00 05"	= "Firma RSA con SHA-1 640/L5";
"06 09 2B 24 03 03 01 01 86 00 05"	= "Firma RSA con SHA-1 768/L5";
"06 09 2B 24 03 03 01 01 87 00 05"	= "Firma RSA con SHA-1 896/L5";
"06 09 2B 24 03 03 01 01 88 00 05"	= "Firma RSA con SHA-1 1024/L5";
"06 09 2B 24 03 03 01 01 84 00 09"	= "Firma RSA con SHA-1 512/L9";
"06 09 2B 24 03 03 01 01 85 00 09"	= "Firma RSA con SHA-1 640/L9";
"06 09 2B 24 03 03 01 01 86 00 09"	= "Firma RSA con SHA-1 768/L9";
"06 09 2B 24 03 03 01 01 87 00 09"	= "Firma RSA con SHA-1 896/L9";
"06 09 2B 24 03 03 01 01 88 00 09"	= "Firma RSA con SHA-1 1024/L9";
"06 09 2B 24 03 03 01 01 84 00 11"	= "Firma RSA con SHA-1 512/L11";
"06 09 2B 24 03 03 01 01 85 00 11"	= "Firma RSA con SHA-1 640/L11";
"06 09 2B 24 03 03 01 01 86 00 11"	= "Firma RSA con SHA-1 768/L11";
"06 09 2B 24 03 03 01 01 87 00 11"	= "Firma RSA con SHA-1 896/L11";
"06 09 2B 24 03 03 01 01 88 00 11"	= "Firma RSA con SHA-1 1024/L11";

"06 06 2B 24 03 03 01 02"			= "Firma RSA con RIPEMD-160";
"06 09 2B 24 03 03 01 02 84 00 02"	= "Firma RSA con RIPEMD-160 512/L2";
"06 09 2B 24 03 03 01 02 85 00 02"	= "Firma RSA con RIPEMD-160 640/L2";
"06 09 2B 24 03 03 01 02 86 00 02"	= "Firma RSA con RIPEMD-160 768/L2";
"06 09 2B 24 03 03 01 02 87 00 02"	= "Firma RSA con RIPEMD-160 896/L2";
"06 09 2B 24 03 03 01 02 88 00 02"	= "Firma RSA con RIPEMD-160 1024/L2";
"06 09 2B 24 03 03 01 02 84 00 03"	= "Firma RSA con RIPEMD-160 512/L3";
"06 09 2B 24 03 03 01 02 85 00 03"	= "Firma RSA con RIPEMD-160 640/L3";
"06 09 2B 24 03 03 01 02 86 00 03"	= "Firma RSA con RIPEMD-160 768/L3";
"06 09 2B 24 03 03 01 02 87 00 03"	= "Firma RSA con RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 03"	= "Firma RSA con RIPEMD-160 1024/L3";
"06 09 2B 24 03 03 01 02 84 00 05"	= "Firma RSA con RIPEMD-160 512/L5";
"06 09 2B 24 03 03 01 02 85 00 05"	= "Firma RSA con RIPEMD-160 640/L5";
"06 09 2B 24 03 03 01 02 86 00 05"	= "Firma RSA con RIPEMD-160 768/L5";
"06 09 2B 24 03 03 01 02 87 00 05"	= "Firma RSA con RIPEMD-160 896/L5";
"06 09 2B 24 03 03 01 02 88 00 05"	= "Firma RSA con RIPEMD-160 1024/L5";
"06 09 2B 24 03 03 01 02 84 00 09"	= "Firma RSA con RIPEMD-160 512/L9";
"06 09 2B 24 03 03 01 02 85 00 09"	= "Firma RSA con RIPEMD-160 640/L9";
"06 09 2B 24 03 03 01 02 86 00 09"	= "Firma RSA con RIPEMD-160 768/L9";
"06 09 2B 24 03 03 01 02 87 00 09"	= "Firma RSA con RIPEMD-160 896/L9";
"06 09 2B 24 03 03 01 02 88 00 09"	= "Firma RSA con RIPEMD-160 1024/L9";
"06 09 2B 24 03 03 01 02 84 00 11"	= "Firma RSA con RIPEMD-160 512/L11";
"06 09 2B 24 03 03 01 02 85 00 11"	= "Firma RSA con RIPEMD-160 640/L11";
"06 09 2B 24 03 03 01 02 86 00 11"	= "Firma RSA con RIPEMD-160 768/L11";
"06 09 2B 24 03 03 01 02 87 00 11"	= "Firma RSA con RIPEMD-160 896/L11";
"06 09 2B 24 03 03 01 02 88 00 11"	= "Firma RSA con RIPEMD-160 1024/L11";

"06 06 2B 24 03 03 01 03"			= "Firma RSA con RIPEMD-128";
"06 06 2B 24 03 03 01 04"			= "Firma RSA con RIPEMD-256";

"06 05 2B 24 03 03 02"				= "Firma ECSIE";
"06 06 2B 24 03 03 02 01"			= "Firma ECSIE con SHA-1";
"06 06 2B 24 03 03 02 02"			= "Firma ECSIE con RIPEMD-160";
"06 06 2B 24 03 03 02 03"			= "Firma ECSIE con MD2";
"06 06 2B 24 03 03 02 04"			= "Firma ECSIE con MD5";

"06 04 2B 24 03 04"					= "Esquema de firmas";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 con RED";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 con RSA";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 con RND";

"06 03 2B 24 04"					= "Atributo";
"06 03 2B 24 05"					= "Política";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "API de un fabricante específico";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "API con funcionalidad específica";
"06 03 2B 24 07"					= "Gestión de claves";
"06 04 2B 24 07 01"					= "Contrato de clave";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "Transferencia de claves";
"06 05 2B 24 07 02 01"				= "ISO9796-2 con encriptación RSA";

"06 05 2B 24 08 01 01"				= "Identificador de política SigiSigConform Teletrust";
"06 05 2B 24 08 02 01"				= "Servicio de directorio";

"06 05 2B 24 08 03 01"				= "Fecha de generación del certificado";
"06 05 2B 24 08 03 02"				= "Adquisición";
"06 05 2B 24 08 03 03"				= "Admisión";
"06 05 2B 24 08 03 04"				= "Límite monetario";
"06 05 2B 24 08 03 05"				= "Declaración de mayoría";
"06 05 2B 24 08 03 06"				= "Número de serie de la tarjeta de circuito integrado";
"06 05 2B 24 08 03 07"				= "Referencia de clave pública";
"06 05 2B 24 08 03 08"				= "Restricción";
"06 05 2B 24 08 03 09"				= "Recuperar si está permitido";
"06 05 2B 24 08 03 0A"				= "Certificado solicitado";
"06 05 2B 24 08 03 0B"				= "Autoridades de nombres";
"06 05 2B 24 08 03 0C"				= "Certificado en el directorio desde";
"06 05 2B 24 08 03 0D"				= "Certificado hash";

"06 05 2B 24 08 04 01"				= "Datos personales";
"06 05 2B 24 08 04 08"				= "Restricción";
"06 07 2B 24 08 05 01 01 01"		= "RSA Indicate SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA Indicate RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "RSA con SHA-1";
"06 07 2B 24 08 05 01 01 04"		= "RSA con RIPEMD-160";
"06 07 2B 24 08 05 01 02 01"		= "DSA ampliado";
"06 07 2B 24 08 05 01 02 02"		= "DSA con RIPEMD-160";

"06 05 2B 24 08 06 01"				= "Certificado";
"06 05 2B 24 08 06 02"				= "Referencia al certificado";
"06 05 2B 24 08 06 03"				= "Certificado de atributos";
"06 05 2B 24 08 06 04"				= "Referencia al atributo";
"06 05 2B 24 08 06 05"				= "Nombre del archivo";
"06 05 2B 24 08 06 06"				= "Tiempo de almacenamiento";
"06 05 2B 24 08 06 07"				= "Tamaño del archivo";
"06 05 2B 24 08 06 08"				= "Ubicación";
"06 05 2B 24 08 06 09"				= "Número de firma";
"06 05 2B 24 08 06 0A"				= "Autogenerado";

"06 05 2B 24 08 07 01"				= "Tipos de presentación Teletrust";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "Binario";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Draw";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "PostScript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "Texto";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Extensión de certificado Thawte";
"06 05 2B 65 01 04 01"				= "Extranet sólida";

/* X.520 */

"06 02 55 04"		= "Tipos de atributos X.520";
"06 03 55 04 00"	= "Clase de objeto";
"06 03 55 04 01"	= "Nombre de entrada con alias";
"06 03 55 04 02"	= "Información de conocimiento";
"06 03 55 04 03"	= "Nombre común";
"06 03 55 04 04"	= "Apellidos";
"06 03 55 04 05"	= "Número de serie";
"06 03 55 04 06"	= "País";
"06 03 55 04 07"	= "Localidad";
"06 04 55 04 07 01"	= "Localidad colectiva";
"06 03 55 04 08"	= "Estado o provincia";
"06 04 55 04 08 01"	= "Estado o provincia colectivo";
"06 03 55 04 09"	= "Dirección";
"06 04 55 04 09 01"	= "Dirección colectiva";
"06 03 55 04 0A"	= "Empresa";
"06 04 55 04 0A 01"	= "Empresa colectiva";
"06 03 55 04 0B"	= "Unidad organizativa";
"06 04 55 04 0B 01"	= "Unidad organizativa colectiva";
"06 03 55 04 0C"	= "Título";
"06 03 55 04 0D"	= "Descripción";
"06 03 55 04 0E"	= "Guía de búsqueda";
"06 03 55 04 0F"	= "Categoría empresarial";
"06 03 55 04 10"	= "Dirección postal";
"06 04 55 04 10 01"	= "Dirección postal colectiva";
"06 03 55 04 11"	= "Código postal";
"06 04 55 04 11 01"	= "Código postal colectivo";
"06 03 55 04 12"	= "Apartado de correos";
"06 04 55 04 12 01"	= "Apartado de correos colectivo";
"06 03 55 04 13"	= "Nombre de oficina de entrega física";
"06 04 55 04 13 01"	= "Nombre de oficina de entrega física colectiva";
"06 03 55 04 14"	= "Número de teléfono";
"06 04 55 04 14 01"	= "Número de teléfono colectivo";
"06 03 55 04 15"	= "Número de télex";
"06 04 55 04 15 01"	= "Número de télex colectivo";
"06 03 55 04 16"	= "Identificador de terminal teletex";
"06 04 55 04 16 01"	= "Identificador de terminal teletex colectivo";
"06 03 55 04 17"	= "Número de teléfono facsímil";
"06 04 55 04 17 01"	= "Número de teléfono facsímil colectivo";
"06 03 55 04 18"	= "Dirección X.121";
"06 03 55 04 19"	= "Número RDSI internacional";
"06 04 55 04 19 01"	= "Número RDSI internacional colectivo";
"06 03 55 04 1A"	= "Dirección registrada";
"06 03 55 04 1B"	= "Indicador de destino";
"06 03 55 04 1C"	= "Método de entrega preferido";
"06 03 55 04 1D"	= "Dirección de presentación";
"06 03 55 04 1E"	= "Contexto de aplicación compatible";
"06 03 55 04 1F"	= "Miembro";
"06 03 55 04 20"	= "Propietario";
"06 03 55 04 21"	= "Ocupante de función";
"06 03 55 04 22"	= "Ver también";
"06 03 55 04 23"	= "Contraseña de usuario";
"06 03 55 04 24"	= "Certificado de usuario";
"06 03 55 04 25"	= "Certificado de CA";
"06 03 55 04 26"	= "Lista de revocación de entidad";
"06 03 55 04 27"	= "Lista de revocación de certificados";
"06 03 55 04 28"	= "Pareja de certificados cruzados";
"06 03 55 04 29"	= "Nombre";
"06 03 55 04 2A"	= "Nombre de pila";
"06 03 55 04 2B"	= "Iniciales";
"06 03 55 04 2C"	= "Calificador de generación";
"06 03 55 04 2D"	= "Identificador único";
"06 03 55 04 2E"	= "Calificador de DN";
"06 03 55 04 2F"	= "Guía de búsqueda mejorada";
"06 03 55 04 30"	= "Información de protocolo";
"06 03 55 04 31"	= "Nombre distinguido";
"06 03 55 04 32"	= "Miembro único";
"06 03 55 04 33"	= "Identificador de vivienda";
"06 03 55 04 34"	= "Algoritmos compatibles";
"06 03 55 04 35"	= "Lista delta de revocación";
"06 03 55 04 36"	= "Autorización";
"06 03 55 04 3A"	= "Pareja de certificados cruzados";

/* X.500 object classes */

"06 02 55 06"		= "Clase de objeto X.520";
"06 03 55 06 00"	= "Superior";
"06 03 55 06 01"	= "Alias";
"06 03 55 06 02"	= "País";
"06 03 55 06 03"	= "Localidad";
"06 03 55 06 04"	= "Empresa";
"06 03 55 06 05"	= "Unidad organizativa";
"06 03 55 06 06"	= "Persona";
"06 03 55 06 07"	= "Persona organizativa";
"06 03 55 06 08"	= "Función organizativa";
"06 03 55 06 09"	= "Grupo de nombres";
"06 03 55 06 0A"	= "Persona residencial";
"06 03 55 06 0B"	= "Proceso de aplicación";
"06 03 55 06 0C"	= "Entidad de aplicación";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "Dispositivo";
"06 03 55 06 0F"	= "Usuario de autenticación sólida";
"06 03 55 06 10"	= "Entidad de certificación";
"06 03 55 06 11"	= "Grupo de nombres únicos";
"06 03 55 06 15"	= "Usuario PKI";
"06 03 55 06 16"	= "CA PKI";

/* X.500 algorithms */

"06 02 55 08"		= "Algoritmos X.500";
"06 03 55 08 01"	= "Algoritmos de encriptación X.500";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "Extensiones de certificado X.509";
"06 03 55 1D 01"	= "Identificador de clave de entidad (antiguo)";
"06 03 55 1D 02"	= "Atributos de clave primaria (antiguos)";
"06 03 55 1D 03"	= "Políticas del certificado (antiguas)";
"06 03 55 1D 04"	= "Restricción del uso de la clave (antiguo)";
"06 03 55 1D 05"	= "Asignaciones de políticas (antiguas)";
"06 03 55 1D 06"	= "Restricción de subdirectorios";
"06 03 55 1D 07"	= "Nombre alternativo del sujeto (antiguo)";
"06 03 55 1D 08"	= "Nombre alternativo del emisor (antiguo)";
"06 03 55 1D 09"	= "Atributos de directorio del sujeto";
"06 03 55 1D 0A"	= "Restricciones básicas (antiguas, 2.5.29.10)";
"06 03 55 1D 0B"	= "Restricciones de nombre (antiguas)";
"06 03 55 1D 0C"	= "Restricciones de política (antiguas)";
"06 03 55 1D 0D"	= "Restricciones básicas (antiguas, 2.5.29.13)";
"06 03 55 1D 0E"	= "Identificador de clave del sujeto";
"06 03 55 1D 0F"	= "Uso de la clave";
"06 03 55 1D 10"	= "Periodo de uso de la clave privada";
"06 03 55 1D 11"	= "Nombre alternativo del sujeto";
"06 03 55 1D 12"	= "Nombre alternativo del emisor";
"06 03 55 1D 13"	= "Restricciones básicas";
"06 03 55 1D 14"	= "Número de lista de revocación de certificados";
"06 03 55 1D 15"	= "Código de razón de CRL";
"06 03 55 1D 16"	= "Fecha de caducidad (antigua)";
"06 03 55 1D 17"	= "Código de instrucción de suspensión";
"06 03 55 1D 18"	= "Fecha de invalidez";
"06 03 55 1D 19"	= "Puntos de distribución de CRL (antiguos)";
"06 03 55 1D 1A"	= "Punto de distribución de emisión (antiguo)";
"06 03 55 1D 1B"	= "Indicador de CRL delta";
"06 03 55 1D 1C"	= "Punto de distribución de emisión";
"06 03 55 1D 1D"	= "Emisor del certificado";
"06 03 55 1D 1E"	= "Restricciones de nombre";
"06 03 55 1D 1F"	= "Puntos de distribución de CRL";
"06 03 55 1D 20"	= "Políticas del certificado";
"06 04 55 1D 20 00"	= "Cualquier identificador de política";
"06 03 55 1D 21"	= "Asignaciones de políticas";
"06 03 55 1D 22"	= "Restricciones de política";
"06 03 55 1D 23"	= "Identificador de clave de entidad";
"06 03 55 1D 24"	= "Restricciones de política";
"06 03 55 1D 25"	= "Uso de clave ampliada";
"06 04 55 1D 25 00"	= "Cualquier uso de clave";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "Algoritmo de firma SDNS";
"06 09 60 86 48 01 65 02 01 01 02"	= "Algoritmo de firma Fortezza";
"06 09 60 86 48 01 65 02 01 01 03"	= "Algoritmo de confidencialidad SDNS";
"06 09 60 86 48 01 65 02 01 01 04"	= "Algoritmo de confidencialidad Fortezza";
"06 09 60 86 48 01 65 02 01 01 05"	= "Algoritmo de integridad SDNS";
"06 09 60 86 48 01 65 02 01 01 06"	= "Algoritmo de integridad Fortezza";
"06 09 60 86 48 01 65 02 01 01 07"	= "Algoritmo de protección de señal SDNS";
"06 09 60 86 48 01 65 02 01 01 08"	= "Algoritmo de protección de señal Fortezza";
"06 09 60 86 48 01 65 02 01 01 09"	= "Algoritmo de gestión de claves SDNS";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Algoritmo de gestión de claves Fortezza";
"06 09 60 86 48 01 65 02 01 01 0B"	= "Algoritmo de firma y de gestión de claves SDNS";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Algoritmo de firma y de gestión de claves Fortezza";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Algoritmo de firma Suite A";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Algoritmo de confidencialidad Suite A";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Algoritmo de integridad Suite A";
"06 09 60 86 48 01 65 02 01 01 10"	= "Algoritmo de protección de señal Suite A";
"06 09 60 86 48 01 65 02 01 01 11"	= "Algoritmo de gestión de claves Suite A";
"06 09 60 86 48 01 65 02 01 01 12"	= "Algoritmo de firma y de gestión de claves Suite A";
"06 09 60 86 48 01 65 02 01 01 13"	= "Algoritmo de firma actualizada Fortezza";
"06 09 60 86 48 01 65 02 01 01 14"	= "Algoritmos de firma actualizada y de gestión de claves Fortezza";
"06 09 60 86 48 01 65 02 01 01 15"	= "Algoritmo de integridad actualizada Fortezza";
"06 09 60 86 48 01 65 02 01 01 16"	= "Algoritmo de intercambio de claves";
"06 09 60 86 48 01 65 02 01 01 17"	= "Algoritmo Wrap80 Fortezza";
"06 09 60 86 48 01 65 02 01 01 18"	= "Algoritmo de encriptación de claves (KEA)";

"06 09 60 86 48 01 65 02 01 02 01"	= "Formato de mensaje RFC 822";
"06 09 60 86 48 01 65 02 01 02 02"	= "Contenido vacío";
"06 09 60 86 48 01 65 02 01 02 03"	= "Tipo de contenido CSP";
"06 09 60 86 48 01 65 02 01 02 2A"	= "Tipo de contenido MSP Rev 3";
"06 09 60 86 48 01 65 02 01 02 30"	= "Tipo de contenido MSP";
"06 09 60 86 48 01 65 02 01 02 31"	= "Protocolo Rekey Agent MSP";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "Tipo de contenido MSP Rev 3.1";
"06 09 60 86 48 01 65 02 01 02 48"	= "Parte del cuerpo del mensaje MSP reenviado";
"06 09 60 86 48 01 65 02 01 02 49"	= "Parámetros de mensaje reenviado MSP";
"06 09 60 86 48 01 65 02 01 02 50"	= "Parte del cuerpo del mensaje CSP reenviado";
"06 09 60 86 48 01 65 02 01 02 51"	= "Parámetros de mensaje reenviado CSP";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "Política de seguridad SDNS";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mosaic PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "Política de seguridad";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "Genérica";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "Política de seguridad por omisión";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "Certificado de gestión de claves SDNS";
"06 09 60 86 48 01 65 02 01 05 02"	= "Certificado de firma de usuario SDNS";
"06 09 60 86 48 01 65 02 01 05 03"	= "Certificado de firma y de gestión de claves SDNS";
"06 09 60 86 48 01 65 02 01 05 04"	= "Certificado de gestión de claves Fortezza";
"06 09 60 86 48 01 65 02 01 05 05"	= "Certificado de firma y de gestión de claves Fortezza";
"06 09 60 86 48 01 65 02 01 05 06"	= "Certificado de firma de usuario Fortezza";
"06 09 60 86 48 01 65 02 01 05 07"	= "Certificado de firma de CA Fortezza";
"06 09 60 86 48 01 65 02 01 05 08"	= "Certificado de firma de CA SDNS";
"06 09 60 86 48 01 65 02 01 05 0A"	= "Vector auxiliar";
"06 09 60 86 48 01 65 02 01 05 0B"	= "Política de confirmación";
"06 09 60 86 48 01 65 02 01 05 0C"	= "Pertenencia";
"06 09 60 86 48 01 65 02 01 05 0D"	= "Administradores";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "CKL Meta SDNS";
"06 09 60 86 48 01 65 02 01 05 29"	= "CKL SDNS";
"06 09 60 86 48 01 65 02 01 05 2A"	= "CKL de firma Meta SDNS";
"06 09 60 86 48 01 65 02 01 05 2B"	= "CKL de firma SDNS";
"06 09 60 86 48 01 65 02 01 05 2C"	= "Lista de revocación de certificados SDNS";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Lista de revocación de certificados Fortezza";
"06 09 60 86 48 01 65 02 01 05 2E"	= "CKL Fortezza";
"06 09 60 86 48 01 65 02 01 05 2F"	= "Procesador de direcciones exentas";
"06 09 60 86 48 01 65 02 01 05 30"	= "Protección";
"06 09 60 86 48 01 65 02 01 05 31"	= "Algoritmos compatibles";
"06 09 60 86 48 01 65 02 01 05 32"	= "Certificado de gestión de claves Suite A";
"06 09 60 86 48 01 65 02 01 05 33"	= "Certificado de firma y de gestión de claves Suite A";
"06 09 60 86 48 01 65 02 01 05 34"	= "Certificado de firma de usuario Suite A";
"06 09 60 86 48 01 65 02 01 05 35"	= "Información PRBAC";
"06 09 60 86 48 01 65 02 01 05 36"	= "Restricciones de CA PRBAC";
"06 09 60 86 48 01 65 02 01 05 37"	= "Privilegios de firma o gestión de claves";
"06 09 60 86 48 01 65 02 01 05 38"	= "Privilegios de comunicación";
"06 09 60 86 48 01 65 02 01 05 39"	= "Atributo con etiqueta";
"06 09 60 86 48 01 65 02 01 05 3A"	= "Archivo de información de política";
"06 09 60 86 48 01 65 02 01 05 3B"	= "Archivo de información de política de seguridad";
"06 09 60 86 48 01 65 02 01 05 3C"	= "Restricción de autorización de CA";

"06 09 60 86 48 01 65 02 01 07 01"		= "Extensiones CSP";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "Categorías de seguridad ISSI";
"06 09 60 86 48 01 65 02 01 08 02"		= "Privilegios de etiqueta de seguridad estándar";

"06 09 60 86 48 01 65 02 01 0A 01"			= "Privilegios de firma";
"06 09 60 86 48 01 65 02 01 0A 02"			= "Privilegios de gestión de claves";
"06 09 60 86 48 01 65 02 01 0A 03"			= "Privilegio de conjuntos de etiquetas con nombre";
"06 09 60 86 48 01 65 02 01 0B 01"			= "UK Demo";
"06 09 60 86 48 01 65 02 01 0B 02"			= "US Department of Defense Class 2";
"06 09 60 86 48 01 65 02 01 0B 03"			= "US Medium Pilot";
"06 09 60 86 48 01 65 02 01 0B 04"			= "US Department of Defense Class 4";
"06 09 60 86 48 01 65 02 01 0B 05"			= "US Department of Defense Class 3";
"06 09 60 86 48 01 65 02 01 0B 06"			= "US Department of Defense Class 5";
"06 09 60 86 48 01 65 02 01 0B 09"			= "US Department of Defense PKI Class 3";

"06 09 60 86 48 01 65 02 01 0C 00"			= "Política de seguridad de prueba";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "Categorías de seguridad TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "Conjunto de etiquetas TSP1 cero";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "Conjunto de etiquetas TSP1 uno";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "Conjunto de etiquetas TSP1 dos";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "Categorías de seguridad TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "Conjunto de etiquetas TSP2 cero";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "Conjunto de etiquetas TSP2 uno";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "Conjunto de etiquetas TSP2 dos";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Categorías de seguridad Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Nombre de conjunto de etiquetas Kafka 1";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Nombre de conjunto de etiquetas Kafka 2";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Nombre de conjunto de etiquetas Kafka 3";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "Entrada de CRL de prueba";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "Etiqueta";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "Identificador de política GAK";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "Identificador de política rudimentaria FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "Identificador de política básica FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "Identificador de política media FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "Identificador de política alta FBCA";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "Clave KRA";
"06 08 60 86 48 01 65 03 02 03"			= "Extensiones";
"06 09 60 86 48 01 65 03 02 03 01"		= "Técnica de recuperación de claves";
"06 09 60 86 48 01 65 03 02 03 02"		= "Compatible con recuperación de claves";
"06 09 60 86 48 01 65 03 02 03 03"		= "Recuperación de claves";
"06 08 60 86 48 01 65 03 02 04"			= "Esquemas de recuperación de claves";
"06 08 60 86 48 01 65 03 02 05"			= "Extensión GAK CSOR";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "Algoritmo NIST";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Algoritmo Novell";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "Pad IV8 DES-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "Pad IV8 DES-EDE2-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "Pad IV8 DES-EDE3-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "Pad RC5-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "MD2 con encriptación RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "MD5 con encriptación RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "SHA-1 con encriptación RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "LM Digest";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC con SHA1-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC con MD5-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "Pad RC2-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "Paquete MD4";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "Encriptación RSA BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "Contraseña NW";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "Tipo de atributo PKI";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "Atributos de seguridad";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "Límite de dependencia";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Identificador de objeto Netscape";
"06 08 60 86 48 01 86 F8 42 01"		= "Extensión de certificado de Netscape";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Tipo de certificado de Netscape";
"06 09 60 86 48 01 86 F8 42 01 02"	= "URL de base de Netscape";
"06 09 60 86 48 01 86 F8 42 01 03"	= "URL de revocación de Netscape";
"06 09 60 86 48 01 86 F8 42 01 04"	= "URL de revocación de CA de Netscape";
"06 09 60 86 48 01 86 F8 42 01 05"	= "URL de descarga de CRL de Netscape";
"06 09 60 86 48 01 86 F8 42 01 06"	= "URL de descarga de certificados de CA de Netscape";
"06 09 60 86 48 01 86 F8 42 01 07"	= "URL de renovación de certificados de Netscape";
"06 09 60 86 48 01 86 F8 42 01 08"	= "URL de política de CA de Netscape";
"06 09 60 86 48 01 86 F8 42 01 09"	= "URL de la página de inicio de certificados de Netscape";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Logotipo de la entidad de certificación de Netscape";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Imagen de usuario de certificados de Netscape";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Nombre del servidor SSL de Netscape";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Comentario de certificado de Netscape";

"06 08 60 86 48 01 86 F8 42 02"		= "Tipo de datos de Netscape";
"06 09 60 86 48 01 86 F8 42 02 01"	= "imagen/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "imagen/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "texto/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Secuencia de certificado de Netscape";
"06 09 60 86 48 01 86 F8 42 02 06"	= "URL de certificado de Netscape";

"06 08 60 86 48 01 86 F8 42 03"			= "Identificador de objeto de directorio de Netscape";
"06 09 60 86 48 01 86 F8 42 03 01"		= "Definiciones LDAP";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "Permiso de conducir";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "Número de departamento";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "Número de empleado";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "Tipo de empleado";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "Persona organizativa de Intranet";

"06 09 60 86 48 01 86 F8 42 04 01"		= "Cifrado por puertas de enlace de servidor";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "CZAG Verisign";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "InBox Verisign";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "Extensión de VPN Verisign desconocida";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "Extensión de VPN Verisign desconocida";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Identificador de política Verisign";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Aviso CPS v1 Verisign";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "CA SGC Verisign";

/* SET */

"06 03 67 2A 00"	= "Tipo de contenido";
"06 04 67 2A 00 00"	= "Datos PAN";
"06 04 67 2A 00 01"	= "Señal PAN";
"06 04 67 2A 00 02"	= "Sólo PAN";

"06 03 67 2A 01"	= "Extensión de mensaje";
"06 03 67 2A 02"	= "Campo";
"06 04 67 2A 02 00"	= "Nombre completo";
"06 04 67 2A 02 01"	= "Nombre de pila";
"06 04 67 2A 02 02"	= "Apellido";
"06 04 67 2A 02 03"	= "Apellido de nacimiento";
"06 04 67 2A 02 04"	= "Nombre de lugar";
"06 04 67 2A 02 05"	= "Número de identificación";
"06 04 67 2A 02 06"	= "Mes";
"06 04 67 2A 02 07"	= "Fecha";
"06 04 67 2A 02 08"	= "Dirección";
"06 04 67 2A 02 09"	= "Teléfono";
"06 04 67 2A 02 0A"	= "Cantidad";
"06 04 67 2A 02 0B"	= "Número de cuenta";
"06 04 67 2A 02 0C"	= "Contraseña";

"06 03 67 2A 03"		= "Atributo";
"06 04 67 2A 03 00"		= "Certificado";
"06 05 67 2A 03 00 00"	= "Huella digital de la clave raíz";
"06 05 67 2A 03 00 01"	= "Política adicional";

"06 03 67 2A 04"	= "Algoritmo";
"06 03 67 2A 05"	= "Política";
"06 04 67 2A 05 00"	= "Raíz";
"06 03 67 2A 06"	= "Módulo";
"06 03 67 2A 07"	= "Extensión de certificado";
"06 04 67 2A 07 00"	= "Clave de raíz hash";
"06 04 67 2A 07 01"	= "Tipo de certificado";
"06 04 67 2A 07 02"	= "Datos del beneficiario";
"06 04 67 2A 07 03"	= "Certificado de tarjeta requerido";
"06 04 67 2A 07 04"	= "Túnel";
"06 04 67 2A 07 05"	= "Extensiones SET";
"06 04 67 2A 07 06"	= "Calificador SET";

"06 03 67 2A 08"	= "Marca";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "Proveedor";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Entrust";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "Nacional";
"06 05 67 2A 0A E2 00"	= "Japón";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "Clave de raíz hash";
"06 04 86 8D 6F 03"	= "Tipo de certificado";
"06 04 86 8D 6F 04"	= "Datos del beneficiario";
"06 04 86 8D 6F 05"	= "Certificado de tarjeta requerido";
"06 04 86 8D 6F 06"	= "Túnel";
"06 04 86 8D 6F 07"	= "Calificador SET";
"06 04 86 8D 6F 63"	= "Datos SET";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Seguridad de datos de Apple";

"06 08 2A 86 48 86 F7 63 64 01" = "Identificador de política de confianza de Apple";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Política iSign de Apple";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Política básica X.509 de Apple";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Política SSL de Apple";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Política de generación de certificados locales de Apple";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Política de generación de CSR local de Apple";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Política de revocación CRL de Apple";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Política de revocación OCSP de Apple";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Política S/MIME de Apple";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Política de autenticación ampliable de Apple";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Política de firma de actualización de software de Apple";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Política IPsec de Apple";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Política iChat de Apple";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Política de firma de recursos de Apple";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Política de cliente Kerberos de Apple";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Política de servidor Kerberos de Apple";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Política de firma de código de Apple";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Política de firma de paquetes de Apple";

"06 08 2A 86 48 86 F7 63 64 02" = "Identificador de algoritmo de seguridad de Apple";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "Encriptación elíptica rápida (FEE)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "Compresión segura Apple (ASC)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "FEE con firma MD5";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "FEE con firma SHA-1";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Encriptación FEED de Apple";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "FEED de Apple (experimental)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "FEE con firma ECDSA";

"06 08 2A 86 48 86 F7 63 64 03" = "Identificador de certificado .Mac de Apple";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Petición de certificado .Mac de Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Petición de certificado de identidad .Mac de Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Petición de certificado de firma de correo electrónico .Mac de Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Petición de certificado de encriptación de correo electrónico .Mac de Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Petición de lista de archivos comprimidos de .Mac de Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Petición de almacenamiento de archivos comprimidos de .Mac de Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Petición de recuperación de archivos comprimidos de .Mac de Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Petición de supresión de archivos comprimidos de .Mac de Apple";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Extensión de certificado .Mac de Apple";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Identidad .Mac de Apple";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Firma de correo electrónico .Mac de Apple";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Encriptación de correo electrónico .Mac de Apple";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Valor de petición de certificado .Mac de Apple";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "Nombre de usuario";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "Contraseña";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "Nombre del host";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "Renovar indicador";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "Indicador asíncrono";

"06 08 2A 86 48 86 F7 63 64 04" = "Uso de clave ampliada de Apple";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Firma de código de Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Firma de código de Apple (desarrollo)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Firma de actualización de software de Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Firma de código de Apple (reservado)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Firma de recursos de Apple";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Firma iChat de Apple";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Encriptación iChat de Apple";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Identidad del sistema Apple";

"06 08 2A 86 48 86 F7 63 64 05" = "Políticas de certificación de Apple";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Política de certificación de Apple";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Política de certificación .Mac de Apple";

/* Extended key usage */

"06 04 55 1D 25 03"					= "Firma de código";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Seguridad CDSA de Intel";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Formatos de seguridad CDSA de Intel";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "Extensiones de certificado X.509v3";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "Extensiones de certificado privado X.509v3";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "Mapa de bits de la firma del sujeto";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "Imagen del sujeto";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "Dirección de correo del sujeto";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "Exenciones de uso";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Algoritmos de seguridad CDSA de Intel";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 con ECDSA";

/* end */
